In [25]:
import mysql.connector
from mysql.connector import errorcode
from sqlalchemy import create_engine
import pandas as pd
import itertools as it

In [10]:
df = pd.read_csv("df_final.csv")
df.head()

,age,attrition,business_travel,daily_rate,department,distance_from_home,education,education_field,employee_number,environment_satisfaction,...,stock_option_level,total_working_years,training_times_last_year,work_life_balance,years_at_company,years_since_last_promotion,years_with_curr_manager,date_birth,salary,remote_work
0,51,no,NaN,2015.72,NaN,6,3,NaN,1,low,...,0,NaN,5,good,20,15,15,1972,195370.0,yes
1,52,no,NaN,2063.39,NaN,1,4,life_sciences,2,high,...,1,34.0,5,good,33,11,9,1971,199990.0,yes
2,42,no,travel_rarely,1984.25,research_&_development,4,2,technical_degree,3,high,...,0,22.0,3,NaN,22,11,15,1981,192320.0,yes
3,47,no,travel_rarely,1771.40,NaN,2,4,medical,4,low,...,2,NaN,2,NaN,20,5,6,1976,171690.0,no
4,46,no,NaN,1582.77,NaN,3,3,technical_degree,5,low,...,1,NaN,5,good,19,2,8,1977,NaN,no

In [11]:
df.columns

Index(['age', 'attrition', 'business_travel', 'daily_rate', 'department',
       'distance_from_home', 'education', 'education_field', 'employee_number',
       'environment_satisfaction', 'gender', 'hourly_rate', 'job_involvement',
       'job_level', 'job_role', 'job_satisfaction', 'marital_status',
       'monthly_income', 'monthly_rate', 'num_companies_worked', 'overtime',
       'percent_salary_hike', 'performance_rating',
       'relationship_satisfaction', 'standard_hours', 'stock_option_level',
       'total_working_years', 'training_times_last_year', 'work_life_balance',
       'years_at_company', 'years_since_last_promotion',
       'years_with_curr_manager', 'date_birth', 'salary', 'remote_work'],
      dtype='object')

# Creating tables

Table 1 - Employees (primary_key: employee_number)    
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Table 4 - education: education_id + education_category  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Table 5 - education_field: education_field_id + education_field  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Table 7 - gender: gender_id + gender  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Table 10 - marital_status: marital_status_id + marital_status  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Table 12 - stock_option_level: stock_option_level_id + stock_option_level (numerica)
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Tables - Salaries  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Table 13 - work_life_balance: work_life_balance_id + work_life_balance_category  

->Table 2 - Identificador de trabajos Tipologias de trabajo  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Table 2 - business_travel: business_travel_id + business_travel_category  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Table 11 - standard_hours: standard_hours_id + standard_hours_category     
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Table - Remote work

-> Table 3 - scale_1_4: scale_id + scale_level  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; [environment_satisfaction, job_satisfaction, relationship_satisfaction, job_involvement]  

-> Table 4 - Department_Role  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Table 3 - department: department_id + department_name  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Table 8 - job_level: job_level_id + job_level  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Table 9 - job_role: job_role_id + job_role

In [ ]:
# Table 2 - Work Typologies
categories1 = df['business_travel'].unique().tolist()
categories2 = df['standard_hours'].unique().tolist()
categories3 = df['remote_work'].unique().tolist()

work_typologies1 = pd.DataFrame({'categories_travel': categories1})
work_typologies2 = pd.DataFrame({'categories_std_hours': categories2})
work_typologies3 = pd.DataFrame({'categories_remote': categories3})

order_mapping1 = {'non_travel': 1, 'travel_rarely': 2, 'travel_frequently': 3, 'NaN': 4}
order_mapping2 = {'full_time': 1, 'part_time': 2, 'NaN': 3}
order_mapping3 = {'yes': 1, 'no': 2, 'NaN': 3}

work_typologies1 = work_typologies1.assign(sort_order = lambda work_typologies1: work_typologies1['categories_travel'].map(order_mapping1)).sort_values('sort_order').drop('sort_order', axis=1)
work_typologies2 = work_typologies2.assign(sort_order = lambda work_typologies2: work_typologies2['categories_std_hours'].map(order_mapping2)).sort_values('sort_order').drop('sort_order', axis=1)
work_typologies3 = work_typologies3.assign(sort_order = lambda work_typologies3: work_typologies3['categories_remote'].map(order_mapping3)).sort_values('sort_order').drop('sort_order', axis=1)

work_typologies1.loc[work_typologies1['categories_travel'] == 'non_travel', 'travel_id'] = 1
work_typologies1.loc[work_typologies1['categories_travel'] == 'travel_rarely', 'travel_id'] = 2
work_typologies1.loc[work_typologies1['categories_travel'] == 'travel_frequently', 'travel_id'] = 3

work_typologies2.loc[work_typologies2['categories_std_hours'] == 'full_time', 'std_hours_id'] = 1


print(work_typologies1)
print(work_typologies2)
print(work_typologies3)

   categories_travel
3         non_travel
1      travel_rarely
2  travel_frequently
0                NaN
  categories_std_hours
0            full_time
2            part_time
1                  NaN
  categories_remote
0               yes
1                no

In [ ]:
# Table 3 - scale
categories = df['environment_satisfaction'].unique().tolist()
#categories
df_scale_1_4 = pd.DataFrame({'scale_level': categories})
#df_scale_1_4
order_mapping = {'low': 1, 'medium': 2, 'high': 3, 'very_high': 4, 'NaN': 5}

# Sort using custom mapping
df_scale = df_scale_1_4.assign(sort_order = lambda df_scale_1_4: df_scale_1_4['scale_level'].map(order_mapping)).sort_values('sort_order').drop('sort_order', axis=1)

df_scale.loc[df_scale['scale_level'] == 'low', 'scale_level_id'] = 1
df_scale.loc[df_scale['scale_level'] == 'medium', 'scale_level_id'] = 2
df_scale.loc[df_scale['scale_level'] == 'high', 'scale_level_id'] = 3
df_scale.loc[df_scale['scale_level'] == 'very_high', 'scale_level_id'] = 4

df_scale['scale_level_id'] = df_scale['scale_level_id'].round().astype('Int64') # Use 'Int64' to handle NaN values

print(df_scale)

  scale_level  scale_level_id
0         low               1
3      medium               2
1        high               3
2   very_high               4
4         NaN            <NA>

In [22]:
user = 'root'
password = 'AlumnaAdalab'
host = '127.0.0.1'

# Try the connection and check the error message and code in case it is not working
try:
  cnx = mysql.connector.connect(user = user, password = password,
                                host = host)
except mysql.connector.Error as err:
  if err.errno == errorcode.ER_ACCESS_DENIED_ERROR:
    print("Something is wrong with your user name or password")
  elif err.errno == errorcode.ER_BAD_DB_ERROR:
    print("Database does not exist")
  else:
    print(err)
else:
  cnx.close()

In [23]:
user = 'root'
password = 'AlumnaAdalab'
host = '127.0.0.1'

# conexión (1)
cnx = mysql.connector.connect(user = user, password = password,
                              host = host)

# cursor (2)
mycursor = cnx.cursor()

try:
    mycursor.execute("CREATE DATABASE project_talent")
    print(mycursor)
except mysql.connector.Error as err:
    print(err)
    print("Error Code:", err.errno)
    print("SQLSTATE", err.sqlstate)
    print("Message", err.msg)

1007 (HY000): Can't create database 'project_talent'; database exists
Error Code: 1007
SQLSTATE HY000
Message Can't create database 'project_talent'; database exists

In [24]:
# Adding the data from artists.csv Database (LastFM) - data on artists
engine_route = 'mysql+mysqlconnector://root:AlumnaAdalab@127.0.0.1/project_talent'
location = 'C:\\Users\\aleiv\\Desktop\\Adalab\\da-promo-50-ana-leiva\\Modulo 3\\Proyecto\\project-da-promo-50-modulo-3-team-4\\df_transformado.csv'

# Create the connection engine
engine = create_engine(engine_route)
# Uppload the CSV file in a DataFrame 
df = pd.read_csv(location)
# Verify that the first registries are in order
print(df.head())

   age attrition business_travel  daily_rate              department  \
0   51        no             NaN     2015.72                     NaN
1   52        no             NaN     2063.39                     NaN
2   42        no   travel_rarely     1984.25  research_&_development
3   47        no   travel_rarely     1771.40                     NaN
4   46        no             NaN     1582.77                     NaN

   distance_from_home  education   education_field  employee_number  \
0                   6          3               NaN                1
1                   1          4     life_sciences                2
2                   4          2  technical_degree                3
3                   2          4           medical                4
4                   3          3  technical_degree                5

  environment_satisfaction  ... stock_option_level  total_working_years  \
0                      low  ...                  0                  NaN
1                     high  ...                  1                 34.0
2                     high  ...                  0                 22.0
3                      low  ...                  2                  NaN
4                      low  ...                  1                  NaN

  training_times_last_year work_life_balance years_at_company  \
0                        5              good               20
1                        5              good               33
2                        3               NaN               22
3                        2               NaN               20
4                        5              good               19

  years_since_last_promotion years_with_curr_manager  date_birth    salary  \
0                         15                      15        1972  195370.0
1                         11                       9        1971  199990.0
2                         11                      15        1981  192320.0
3                          5                       6        1976  171690.0
4                          2                       8        1977       NaN

   remote_work
0          yes
1          yes
2          yes
3           no
4           no

[5 rows x 35 columns]